import numpy as np
from scipy.signal import correlate2d

# 生成的 3x3 卷积核
conv_kernel = np.array( [[3, 5, 2],
                                                         [5, 5, 0],
                                                         [2, 1, 4]])
                                                       
                                                        
# 生成的 12x12 矩阵
matrix = np.array([[4, 5, 4, 5, 5, 4, 3, 2, 4, 4, 2, 2],
                                                         [4, 4, 5, 5, 5, 4, 3, 3, 4, 5, 0, 0],
                                                         [5, 0, 5, 4, 3, 0, 2, 2, 2, 3, 2, 3],
                                                         [2, 3, 3, 4, 3, 3, 0, 2, 4, 0, 1, 3],
                                                         [4, 5, 1, 1, 0, 4, 1, 0, 4, 1, 2, 2],
                                                         [2, 1, 1, 5, 4, 5, 5, 4, 3, 2, 1, 3],
                                                         [1, 2, 5, 1, 5, 5, 2, 1, 4, 0, 0, 1],
                                                         [2, 4, 3, 3, 5, 2, 4, 4, 1, 5, 5, 1],
                                                         [2, 5, 2, 0, 2, 4, 2, 5, 0, 3, 4, 0],
                                                         [5, 4, 2, 3, 1, 4, 4, 0, 1, 3, 2, 3],
                                                         [5, 0, 0, 2, 2, 5, 0, 0, 4, 0, 5, 4],
                                                         [0, 1, 1, 0, 4, 5, 3, 2, 2, 4, 1, 2]])

# 使用 valid 模式进行 2D 相关计算
result_valid = correlate2d(matrix, conv_kernel, mode='valid')
print(result_valid)
